CF/InformationRegisters/НастройкиКлючевыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НастройкиКлючевыхОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиКлючевыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючеваяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючевыеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Catalogs/КлючевыеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>КлючевыеОперации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноДопустимыйУровень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниПроизводительности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелевоеВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяХеш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/InformationRegisters/НастройкиКлючевыхОпераций/Forms/ФормаРедактирования/Ext/Form/Module.bsl
#Область ПрограммныйИнтерфейс

&НаСервере
Процедура  ЗаполнитьДеревоНаСервере()

	 ЗаполнитьДерево(ЭтаФорма); 

КонецПроцедуры //  ЗаполнитьДеревоНаСервере()()

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Не Пользователи.РолиДоступны("ПолныеПрава") Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ОбновитьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКлючевыхОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    ТекущаяСтрока = Элементы.ДеревоКлючевыхОпераций.ТекущиеДанные;
    
    Если ТекущаяСтрока = Неопределено Тогда    
        Возврат;    
    КонецЕсли; 
    
    Значение = ТекущаяСтрока.КлючеваяОперация;
    
    ТипСправочника  = ТипЗнч(Значение);
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Ключ", Значение);
    
    Если ТипЗнч(ТекущаяСтрока.КлючеваяОперация) = Тип("СправочникСсылка.ПрофилиКлючевыхОпераций") Тогда
        ОткрытьФорму("Справочник.ПрофилиКлючевыхОпераций.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    ИначеЕсли ТипЗнч(ТекущаяСтрока.КлючеваяОперация) = Тип("СправочникСсылка.КлючевыеОперации") Тогда
        ОткрытьФорму("Справочник.КлючевыеОперации.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрофильКлючевыхОперацийПриИзменении(Элемент)
    ЗаполнитьДеревоНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьВсеФлажки(Команда)
	
	ПроставитьФлажки(ДеревоКлючевыхОпераций.ПолучитьЭлементы(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьВсеФлажки(Команда)
	
	ПроставитьФлажки(ДеревоКлючевыхОпераций.ПолучитьЭлементы(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьНаборСервер();
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
    ЗаписатьНаборСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоКлючевыхОпераций(Команда)
   ОбновитьДерево();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДерево()

	   ЗаполнитьДерево(ЭтаФорма);

КонецПроцедуры 
   
&НаСервереБезКонтекста
Процедура ЗаполнитьДерево(ЭтаФорма)
    
    МассивИсключаемыхПрав = Новый Массив;
    
	КлючевыеОперации = ДанныеФормыВЗначение(ЭтаФорма.ДеревоКлючевыхОпераций, Тип("ДеревоЗначений"));
	КлючевыеОперации.Строки.Очистить();	
		
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    КлючевыеОперацииВПрофиле.Ссылка КАК Профиль,
                   |    КлючевыеОперацииВПрофиле.КлючеваяОперация КАК КлючеваяОперация,
                   |    НастройкиКлючевыхОпераций.Использовать КАК Использовать,
                   |    МИНИМУМ(КлючевыеОперацииВПрофиле.ЦелевоеВремя) КАК ЦелевоеВремя,
                   |    МИНИМУМ(КлючевыеОперацииВПрофиле.Приоритет) КАК Приоритет
                   |ИЗ
                   |    Справочник.ПрофилиКлючевыхОпераций.КлючевыеОперацииПрофиля КАК КлючевыеОперацииВПрофиле
                   |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиКлючевыхОпераций КАК НастройкиКлючевыхОпераций
                   |        ПО КлючевыеОперацииВПрофиле.Ссылка = НастройкиКлючевыхОпераций.Профиль
                   |            И КлючевыеОперацииВПрофиле.КлючеваяОперация = НастройкиКлючевыхОпераций.КлючеваяОперация
                   |";
  
        Если ЗначениеЗаполнено(ЭтаФорма.ПрофильКлючевыхОпераций) Тогда
            ТекстЗапроса = ТекстЗапроса + "     
                    |ГДЕ
                    |   КлючевыеОперацииВПрофиле.Ссылка = &ПрофильКлючевыхОпераций
                    |";
        КонецЕсли;
        
        ТекстЗапроса = ТекстЗапроса + "
                   |
                   |СГРУППИРОВАТЬ ПО
                   |    КлючевыеОперацииВПрофиле.КлючеваяОперация,
                   |    НастройкиКлючевыхОпераций.Использовать,
                   |    КлючевыеОперацииВПрофиле.Ссылка
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |    КлючевыеОперацииВПрофиле.Ссылка.Наименование,
                   |    КлючевыеОперацииВПрофиле.КлючеваяОперация.Наименование";

               
    Запрос = Новый Запрос;
    Запрос.Текст = ТекстЗапроса;
    
    Если ЗначениеЗаполнено(ЭтаФорма.ПрофильКлючевыхОпераций) Тогда
        Запрос.УстановитьПараметр("ПрофильКлючевыхОпераций", ЭтаФорма.ПрофильКлючевыхОпераций); 
    КонецЕсли;

    ПредыдущийПрофиль = Справочники.ПрофилиКлючевыхОпераций.ПустаяСсылка();
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        
         ТекущийПрофиль = Выборка.Профиль;
        
         Если НЕ ПредыдущийПрофиль = ТекущийПрофиль Тогда 
              Профиль = КлючевыеОперации.Строки.Добавить();
              Профиль.ЭтоГруппа         = Истина;
              Профиль.КлючеваяОперация  = Выборка.Профиль;                 
              ПредыдущийПрофиль = ТекущийПрофиль;                
         КонецЕсли;
         
           КлючеваяОперация = Профиль.Строки.Добавить();
           КлючеваяОперация.ЭтоГруппа         = Ложь;
           КлючеваяОперация.КлючеваяОперация  = Выборка.КлючеваяОперация;
           КлючеваяОперация.Использовать      = Выборка.Использовать;
           КлючеваяОперация.ЦелевоеВремя      = Выборка.ЦелевоеВремя;
           КлючеваяОперация.Приоритет         = Выборка.Приоритет;

    КонецЦикла;
    
    ЗначениеВДанныеФормы(КлючевыеОперации, ЭтаФорма.ДеревоКлючевыхОпераций);
    
	Модифицированность = Ложь;
	       
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьФлажки(ЭлементыДерева, ЗначениеФлажки)

	Для каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева.ЭтоГруппа Тогда
			ПроставитьФлажки(ЭлементДерева.ПолучитьЭлементы(), ЗначениеФлажки)
		Иначе
			ЭлементДерева.Использовать = ЗначениеФлажки;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаборСервер(СброситьМодифицированность = Истина)
    
    КлючевыеОперации = ДанныеФормыВЗначение(ЭтаФорма.ДеревоКлючевыхОпераций, Тип("ДеревоЗначений"));
    
    ТаблицаКлючевыхОпераций = Новый ТаблицаЗначений;
    ТаблицаКлючевыхОпераций.Колонки.Добавить("Профиль");
    ТаблицаКлючевыхОпераций.Колонки.Добавить("КлючеваяОперация");
    ТаблицаКлючевыхОпераций.Колонки.Добавить("Использовать");
    ТаблицаКлючевыхОпераций.Колонки.Добавить("ЦелевоеВремя");
    ТаблицаКлючевыхОпераций.Колонки.Добавить("Приоритет");
      
    Для каждого ТекущийПрофиль из КлючевыеОперации.Строки Цикл 
        
        Профиль =  ТекущийПрофиль.КлючеваяОперация;
        
        Для каждого ТекущаяКлючеваяОперация Из ТекущийПрофиль.Строки Цикл
            
            КлючеваяОперация = ТаблицаКлючевыхОпераций.Добавить();
            
            ЗаполнитьЗначенияСвойств(КлючеваяОперация, 
                                        ТекущаяКлючеваяОперация);
            
            КлючеваяОперация.Профиль = Профиль;  
            
        КонецЦикла; 
        
     
    КонецЦикла;
    
    НачатьТранзакцию();
    
    Попытка   
        
        Блокировка = Новый БлокировкаДанных;
        ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиКлючевыхОпераций");
        ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
        Блокировка.Заблокировать();
        
        НаборЗаписей = РегистрыСведений.НастройкиКлючевыхОпераций.СоздатьНаборЗаписей();
        
        Если ЗначениеЗаполнено(ПрофильКлючевыхОпераций) Тогда
            НаборЗаписей.Отбор.Профиль.Установить(ПрофильКлючевыхОпераций);   
        КонецЕсли;
        
        НаборЗаписей.Загрузить(ТаблицаКлючевыхОпераций);
        НаборЗаписей.Записать(Истина);
        
        Если СброситьМодифицированность Тогда
            Модифицированность = Ложь;
        КонецЕсли;
        
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию(); 
    КонецПопытки; 
    
       
 КонецПроцедуры

&НаКлиенте
Процедура ДеревоКлючевыхОперацийИспользоватьПриИзменении(Элемент)
    
    ТекущаяСтрокаДерева = Элементы.ДеревоКлючевыхОпераций.ТекущиеДанные;
    
    Если ТекущаяСтрокаДерева = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если Не ТекущаяСтрокаДерева.ЭтоГруппа Тогда 
         Возврат;   
    КонецЕсли;  
     
    ПроставитьФлажки(ТекущаяСтрокаДерева.ПолучитьЭлементы(), ТекущаяСтрокаДерева.Использовать);
    
КонецПроцедуры

#КонецОбласти
